---
type: SolidOrShellTessellationControls
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# SolidOrShellTessellationControls

`Autodesk.Revit.DB.SolidOrShellTessellationControls` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SolidOrShellTessellationControls | 2013 | `public SolidOrShellTessellationControls ()` |
| Method | DisableLevelOfDetail | 2013 | `public void DisableLevelOfDetail ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | UseLevelOfDetail | 2013 | `public bool UseLevelOfDetail ()` |
| Property | Accuracy | 2013 | `public double Accuracy { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LevelOfDetail | 2013 | `public double LevelOfDetail { get ; set ; }` |
| Property | MinAngleInTriangle | 2013 | `public double MinAngleInTriangle { get ; set ; }` |
| Property | MinExternalAngleBetweenTriangles | 2013 | `public double MinExternalAngleBetweenTriangles { get ; set ; }` |